posts/my-first-post.org
#+BEGIN_COMMENT
.. title: My first post
.. slug: my-first-post
.. date: 2020-09-30 21:15:13 UTC+02:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

# -*- mode: org -*-
#+STARTUP: indent hidestars showall
#+OPTIONS: toc:2 

* Here is my first post

I want to write posts and a homepage in org mode.
(I dislike =markdown=, and I detest typing math in =rst=.)
After watching one of the blogs on [[https://cestlaz.github.io/stories/emacs/][Cest la Z]]  I considered =nikola= as a good option to set things up.
It turned out to be really easy; I just followed the steps as described [[https://streakycobra.github.io/posts/blogging-in-org-mode-with-nikola/][Here]]. I had to install some python packages, but with =pip= this was a no brainer.


There was one caveat with including source code blocks in =org= files.
After reading the error messages, I noticed that I had to install the emacs =htlmize= package.
The =init.el= and =myinit.org= files on my [[https://github.com/ndvanforeest/emacs][emacs repo]] show how to set this up.

And now all works!
