cache/posts/my-first-post.html
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb9698e5">Here is my first post</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb9698e5" class="outline-2">
<h2 id="orgb9698e5">Here is my first post</h2>
<div class="outline-text-2" id="text-orgb9698e5">
<p>
I want to write posts and a homepage in org mode.
(I dislike <code>markdown</code>, and I detest typing math in <code>rst</code>.)
After watching one of the blogs on <a href="https://cestlaz.github.io/stories/emacs/">Cest la Z</a>  I considered <code>nikola</code> as a good option to set things up.
It turned out to be really easy; I just followed the steps as described <a href="https://streakycobra.github.io/posts/blogging-in-org-mode-with-nikola/">here</a>. I had to install some python packages, but with <code>pip</code> this was a no brainer.
</p>


<p>
There was one caveat with including source code blocks in <code>org</code> files.
After reading the error messages, I noticed that I had to install the emacs <code>htlmize</code> package.
The <code>init.el</code> and <code>myinit.org</code> files on my <a href="https://github.com/ndvanforeest/emacs">emacs repo</a> show how to set this up.
</p>

<p>
And now all works!
</p>
</div>
</div>
